app/controllers/articles_controller.rb

SELECT * FROM `articles`
---
  def index
    @articles = Article.all

SELECT * FROM `articles` WHERE (`articles`.`id` = 1)
---
  def show
    @article = Article.find(params[:id])

INSERT INTO `articles` (`created_at`, `updated_at`, `content`) VALUES('2011-03-15 04:31:15', '2011-03-15 04:31:15', 'article 1')
---
  def create
    @article = Article.new(params[:article])

    respond_to do |format|
      if @article.save