app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('HQNTxMOKRaT3BR0Gjlel', '2011-03-09 22:11:18', '2011-03-09 22:11:19', '4cf7f7538862c01653e8bbe8680c4b48dd88af16ab434230d5ced98e2174e13d80f51bfa58fa081b794ceed8326423b840ba2dfbdad66eca934d55f66f260fe6', '9HzK6m0xQNJfnlh1X1DW', '2011-03-09 22:11:19', 0, '127.0.0.1', 'aozKWUlxz2yXRAwhiVk9', '2011-03-09 22:11:18', '8eafd76ca853e33d5ca3dbc8fa125f83c7d508733ba0666df7c9530ca8130d56825044bade14982a19892243007e81715e0bf515fba6447b1f78dd6d6d7a661a', 1, NULL, 'abhilash', NULL, 'abhi@mail.com')